Godcomplexx/Keychain_motion/xiao_nrf52840/src/main.c
#include <stdbool.h>
#include <stdint.h>

#include <nrf.h>
#include <zephyr/devicetree.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/kernel.h>
#include <zephyr/random/random.h>
#include <zephyr/usb/usb_device.h>
#if defined(CONFIG_BOOTLOADER_MCUBOOT)
#include <zephyr/dfu/mcuboot.h>
#endif

#include "breakout_game.h"
#include "device_clock.h"
#include "esp_log.h"
#include "flip_animation.h"
#include "motion_detector.h"
#include "motion_state.h"
#include "mpu6050.h"
#include "mpu6050_optional.h"
#include "battery.h"
#include "i2c_scan.h"
#include "oled_display.h"
#include "oled_display_optional.h"
#include "pet_behavior.h"
#include "pet_face.h"
#include "phone_sync.h"
#include "step_counter.h"
#include "time_animation.h"
#include "usb_dfu_touch.h"

#define ACTIVE_FRAME_DELAY_MS 25
#define GAME_FRAME_DELAY_MS 40
#define LOW_POWER_LOOP_DELAY_MS 50
#define STARTUP_SCREEN_DELAY_MS 1000
#define HARDWARE_RETRY_INTERVAL_US 5000000
#define SENSORLESS_BLE_RETRY_US 5000000
#define MICROSECONDS_PER_SECOND 1000000.0f
#define TIME_FRAME_INTERVAL_US 1000000
#define TIME_STATE_DURATION_US 60000000
#define SLEEP_STILLNESS_TIMEOUT_US 30000000
#define MOTION_MOVEMENT_DELTA_THRESHOLD 80
#define MOTION_SHAKE_DELTA_THRESHOLD 350
#define MOTION_SHAKE_COUNT_REQUIRED 3
#define MOTION_SHAKE_WINDOW_US 2500000
#define PHONE_SYNC_WINDOW_US 60000000
#define PHONE_SYNC_SHUTDOWN_GRACE_MS 200
#define OLED_ACTIVE_CONTRAST 0x9F
#define OLED_GAME_CONTRAST 0x8F
#define OLED_IDLE_CONTRAST 0x18
#define RAW_LOG_INTERVAL_FRAMES 200
/* The companion face is redrawn slowly in SLEEP to keep the average current low. */
#define PET_SLEEP_FRAME_INTERVAL_US 200000
/* A cell voltage moves slowly; sampling it often would only waste current. */
#define BATTERY_SAMPLE_INTERVAL_US 10000000
/* Tilt gestures need hysteresis, otherwise every frame near the edge fires. */
#define TILT_TRIGGER_G 0.35f
#define TILT_RELEASE_G 0.18f
/* Below this the keychain counts as level and the gaze rests in the middle. */
#define TILT_DEAD_ZONE_G 0.06f
/*
 * Tip it steeply and hold, like tipping a glass, and the particles come out.
 * Steep enough and long enough that ordinary handling cannot do it by accident.
 */
#define PLAY_GESTURE_TILT_G 0.80f
#define PLAY_GESTURE_HOLD_US 1500000

static const char *TAG = "keychain";

/*
 * On this PCB the USB 5 V rail feeds both the charger (U1) and the module VBUS
 * pin, so "VBUS is present" is the same fact as "the charger is plugged in".
 *
 * This reads the SoC's own VBUS detector instead of listening to USB device
 * stack callbacks. The E73 image enumerates no USB class at all - the
 * nrf52840dk devicetree has no cdc-acm node, so CONFIG_USB_CDC_ACM is dropped -
 * and would therefore never receive a single callback. The POWER peripheral
 * answers regardless, and a dumb charger that never enumerates still raises
 * VBUS, which a USB callback could not have reported either.
 */
static bool charger_is_attached(void)
{
    return (NRF_POWER->USBREGSTATUS & POWER_USBREGSTATUS_VBUSDETECT_Msk) != 0U;
}

#if DT_NODE_EXISTS(DT_NODELABEL(accel_int))

/*
 * ACC_INT1 reaches U4 pin 22 = P0.07, and the LIS2DW12 pulses it on wake-up.
 * The devicetree pulls the line down, so an unsoldered sensor cannot produce
 * phantom edges. This is the path that will let the SoC sleep and be woken by
 * movement instead of polling the sensor.
 */
static const struct gpio_dt_spec s_accel_int =
    GPIO_DT_SPEC_GET(DT_NODELABEL(accel_int), gpios);
static struct gpio_callback s_accel_int_callback;
static volatile bool s_accel_int_fired;

static void accel_int_handler(const struct device *port,
                              struct gpio_callback *callback,
                              gpio_port_pins_t pins)
{
    ARG_UNUSED(port);
    ARG_UNUSED(callback);
    ARG_UNUSED(pins);
    s_accel_int_fired = true;
}

static void accel_int_init(void)
{
    if (!gpio_is_ready_dt(&s_accel_int) ||
        gpio_pin_configure_dt(&s_accel_int, GPIO_INPUT) != 0 ||
        gpio_pin_interrupt_configure_dt(&s_accel_int,
                                        GPIO_INT_EDGE_TO_ACTIVE) != 0) {
        ESP_LOGW(TAG, "ACC_INT1 could not be armed");
        return;
    }
    gpio_init_callback(&s_accel_int_callback, accel_int_handler,
                       BIT(s_accel_int.pin));
    (void)gpio_add_callback(s_accel_int.port, &s_accel_int_callback);
    ESP_LOGI(TAG, "ACC_INT1 armed on P0.%02u", s_accel_int.pin);
}

/* Consume a pending edge, if any. */
static bool accel_int_take(void)
{
    if (!s_accel_int_fired) {
        return false;
    }
    s_accel_int_fired = false;
    return true;
}

#else

static void accel_int_init(void)
{
    /* No ACC_INT1 line in this build. */
}

static bool accel_int_take(void)
{
    return false;
}

#endif

/*
 * Turn a tilt in g into the -100..100 the face follows.
 *
 * A small dead zone keeps a keychain lying flat from twitching, and the caller
 * smooths the result so the eyes glide instead of chattering at 40 frames per
 * second.
 */
static int8_t tilt_to_percent(float tilt)
{
    const float magnitude = (tilt < 0.0f) ? -tilt : tilt;
    if (magnitude < TILT_DEAD_ZONE_G) {
        return 0;
    }

    int value = (int)(tilt * 100.0f);
    if (value > 100) { value = 100; }
    if (value < -100) { value = -100; }
    return (int8_t)value;
}

/*
 * Convert a raw tilt reading into -1, 0 or +1 with hysteresis: the gesture only
 * re-arms after the keychain returns close to level.
 */
static int tilt_zone(float tilt_x, int previous_zone)
{
    const float magnitude = (tilt_x < 0.0f) ? -tilt_x : tilt_x;
    if (previous_zone != 0 && magnitude < TILT_RELEASE_G) {
        return 0;
    }
    if (tilt_x <= -TILT_TRIGGER_G) {
        return -1;
    }
    if (tilt_x >= TILT_TRIGGER_G) {
        return 1;
    }
    return previous_zone;
}

static int64_t uptime_us(void)
{
    return k_ticks_to_us_floor64(k_uptime_ticks());
}

/*
 * The resting screen is the same companion face, only redrawn a few times per
 * second. The pet decides what it looks like there: bored, asleep or busy with
 * one of its own activities.
 */
static esp_err_t render_pet_sleep_frame_if_due(int64_t now_us,
                                               int64_t *previous_frame_us,
                                               const pet_view_t *view,
                                               float tilt_x, float tilt_y,
                                               float frame_seconds)
{
    if (!oled_display_is_available()) {
        return ESP_OK;
    }

